Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_ZShapeProfile.FilletRadius Property
 The fillet radius.
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double FilletRadius { get; }
Public ReadOnly Property FilletRadius As Double
	Get
Property Value
Type: Double
See Also
Reference
IFC2X3_ParametricObject_ZShapeProfile Class
Tekla.Structures.Model.Collaboration Namespace